update mermaid flow graph
